AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo4l/regs/apollo4b_mram.h
/*
 * Copyright (c) 2020, Ambiq Micro, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 * contributors may be used to endorse or promote products derived from this
 * software without specific prior written permission.
 *
 * Third party software included in this distribution is subject to the
 * additional license terms as defined in the /docs/licenses directory.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     apollo4b_mram.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     06. November 2020
 * @note     Generated by SVDConv V3.3.35 on Friday, 06.11.2020 15:52:21
 *           from File './apollo4b_x.svd',
 *           last modified on Friday, 06.11.2020 21:52:20
 */
#ifndef APOLLO4B_MRAM_H
#define APOLLO4B_MRAM_H

#ifdef __cplusplus
extern "C" {
#endif

/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

#define MRAM_BASE                   0x40014000UL

/* =========================================================================================================================== */
/* ================                                           MRAM                                            ================ */
/* =========================================================================================================================== */

/**
  * @brief MRAM Controller (MRAM)
  */

typedef struct {                                /*!< (@ 0x40014000) MRAM Structure                                             */

  union {
    __IOM uint32_t STATUS;                      /*!< (@ 0x00000000) MRAM Controller Status                                     */

    struct {
      __IOM uint32_t BUSY       : 1;            /*!< [0..0] Controller Busy. This bit reflects the status of the
                                                     most recently requested MRAM operation. When set to 1,
                                                     the MRAM Controller is still processing the last operation.
                                                     When set to 0, the controller is idle and ready to accept
                                                     a new command request.                                                    */
      __IOM uint32_t ADDRERROR  : 1;            /*!< [1..1] Write Address Error. When set to 1, this bit indicates
                                                     that an address has been written to the WRADDR register
                                                     which is outside the range of valid addresses for the MRAM
                                                     Memory. This bit will be cleared on a write to the WRADDR
                                                     register with a value that falls in the range of valid
                                                     addresses. Additionally, when a write to the Write Data
                                                     registers occurs and the Write Address is auto-incremented,
                                                     this bit will be set if the new address increments beyond
                                                     the end of the valid MRAM address space.                                  */
            uint32_t            : 30;
    } STATUS_b;
  } ;

  union {
    __IOM uint32_t CTRL;                        /*!< (@ 0x00000004) MRAM Controller Control                                    */

    struct {
      __IOM uint32_t LOAD       : 1;            /*!< [0..0] Writing a 1 to this bitfield initiates a programming
                                                     operation to the MRAM Information space. Writing a 0 to
                                                     this bitfield terminates the programming operation.                       */
      __IOM uint32_t CLRLOAD    : 1;            /*!< [1..1] Writing a 1 to this bitfield initiates a programming
                                                     operation to the MRAM Information space. Writing a 0 to
                                                     this bitfield terminates the programming operation.                       */
      __IOM uint32_t PROGRAM    : 1;            /*!< [2..2] Writing a 1 to this bitfield initiates a programming
                                                     operation to the MRAM Data space. Writing a 0 to this bitfield
                                                     terminates the programming operation.                                     */
      __IOM uint32_t GENCMD     : 1;            /*!< [3..3] Writing a 1 to this bitfield initiates a general command
                                                     to the TMC (see TMCCMD). TMCOVERRIDE must be enabled                      */
            uint32_t            : 28;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t ACCESS;                      /*!< (@ 0x00000008) Key Register for the MRAM Controller                       */

