AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo4l/regs/apollo4b_mram.h
    struct {
      __IOM uint32_t ACCESS     : 32;           /*!< [31..0] Key register value.                                               */
    } ACCESS_b;
  } ;

  union {
    __IOM uint32_t WRADDR;                      /*!< (@ 0x0000000C) MRAM Controller Write Address                              */

    struct {
      __IOM uint32_t ADDR       : 24;           /*!< [23..0] The value written to this field contains the byte address
                                                     to use for the next Erase or Program operation to the MRAM
                                                     Instance. An instance address is required (i.e. 0-0x3FFFF).
                                                     If an invalid address is written, the Address Error bit
                                                     of the Status register will be set.                                       */
            uint32_t            : 6;
      __IOM uint32_t INFO0      : 1;            /*!< [30..30] Indicates programming operation applies to INFO0 space           */
      __IOM uint32_t INFO1      : 1;            /*!< [31..31] Indicates programming operation applies to INFO1 space.
                                                     Must be unlocked by INFO1 program key.                                    */
    } WRADDR_b;
  } ;

  union {
    __IOM uint32_t WDATA0;                      /*!< (@ 0x00000010) MRAM Controller Write Data0                                */

    struct {
      __IOM uint32_t DATA0      : 32;           /*!< [31..0] Data[31:0] when programming data/info spaces                      */
    } WDATA0_b;
  } ;

  union {
    __IOM uint32_t WDATA1;                      /*!< (@ 0x00000014) MRAM Controller Write Data1                                */

    struct {
      __IOM uint32_t DATA1      : 32;           /*!< [31..0] Data[63:32] when programming data/info spaces                     */
    } WDATA1_b;
  } ;

  union {
    __IOM uint32_t WDATA2;                      /*!< (@ 0x00000018) MRAM Controller Write Data2                                */

    struct {
      __IOM uint32_t DATA2      : 32;           /*!< [31..0] Data[95:64] when programming data/info spaces                     */
    } WDATA2_b;
  } ;

  union {
    __IOM uint32_t WDATA3;                      /*!< (@ 0x0000001C) MRAM Controller Write Data3                                */

    struct {
      __IOM uint32_t DATA3      : 32;           /*!< [31..0] Data[127:96] when programming data/info spaces                    */
    } WDATA3_b;
  } ;
  __IM  uint32_t  RESERVED[8];

  union {
    __IOM uint32_t KEY0;                        /*!< (@ 0x00000040) INFO1 Key0                                                 */

    struct {
      __IOM uint32_t KEY0       : 32;           /*!< [31..0] 128-bit key protecting INFO1 accesses                             */
    } KEY0_b;
  } ;

  union {
    __IOM uint32_t KEY1;                        /*!< (@ 0x00000044) INFO1 Key1                                                 */

    struct {
      __IOM uint32_t KEY1       : 32;           /*!< [31..0] 128-bit key protecting INFO1 accesses                             */
    } KEY1_b;
  } ;

  union {
    __IOM uint32_t KEY2;                        /*!< (@ 0x00000048) INFO1 Key2                                                 */

    struct {
      __IOM uint32_t KEY2       : 32;           /*!< [31..0] 128-bit key protecting INFO1 accesses                             */
    } KEY2_b;
  } ;

  union {
    __IOM uint32_t KEY3;                        /*!< (@ 0x0000004C) INFO1 Key3                                                 */

    struct {
      __IOM uint32_t KEY3       : 32;           /*!< [31..0] 128-bit key protecting INFO1 accesses                             */
    } KEY3_b;
  } ;

  union {
    __IOM uint32_t TMCCTRL;                     /*!< (@ 0x00000050) MRAM Controller Manual Control                             */

    struct {
      __IOM uint32_t TMCRST     : 1;            /*!< [0..0] Manual override on TMC reset (1=reset 0=out of reset)              */
      __IOM uint32_t TMCLPR     : 1;            /*!< [1..1] Manual override on TMC LPR (low power mode)                        */
      __IOM uint32_t TMCPD      : 1;            /*!< [2..2] Manual override on TMC PD (powerdown)                              */
      __IOM uint32_t TMCSLP     : 1;            /*!< [3..3] Manual override on TMC sleep                                       */
      __IOM uint32_t TMCOVERRIDE : 1;           /*!< [4..4] Manual override controle enable                                    */
            uint32_t            : 27;
    } TMCCTRL_b;
  } ;

  union {
    __IOM uint32_t TMCCMD;                      /*!< (@ 0x00000054) MRAM Controller Manual Command                             */

    struct {
      __IOM uint32_t TMCCMD     : 5;            /*!< [4..0] 4-bit command to send                                              */
      __IOM uint32_t TMCYADR    : 5;            /*!< [9..5] YADR value                                                         */
      __IOM uint32_t TMCXADR    : 12;           /*!< [21..10] XADR value                                                       */
      __IOM uint32_t TMCINFO0   : 1;            /*!< [22..22] Info0 control line                                               */
      __IOM uint32_t TMCINFO1   : 1;            /*!< [23..23] INFO1 control line                                               */
      __IOM uint32_t TMCSRAMDMA : 1;            /*!< [24..24] SRAM DMA control line                                            */
      __IOM uint32_t TMCIFREN1  : 1;            /*!< [25..25] Enable the access to TMC Info1 register                          */
            uint32_t            : 6;
    } TMCCMD_b;
  } ;

  union {
    __IOM uint32_t TMCSTAT;                     /*!< (@ 0x00000058) MRAM Controller Manual Status                              */

    struct {
      __IOM uint32_t TMCERROR   : 5;            /*!< [4..0] 128-bit key protecting INFO1 accesses                              */
            uint32_t            : 3;
      __IOM uint32_t TMCBUSY    : 1;            /*!< [8..8] 128-bit key protecting INFO1 accesses                              */
            uint32_t            : 23;
    } TMCSTAT_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t TMCRD0;                      /*!< (@ 0x00000060) MRAM Controller Debug Read Data                            */

