AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo4l/regs/apollo4b_mram.h
    struct {
      __IOM uint32_t TMCREAD0   : 32;           /*!< [31..0] Debug Read data                                                   */
    } TMCRD0_b;
  } ;

  union {
    __IOM uint32_t TMCRD1;                      /*!< (@ 0x00000064) MRAM Controller Debug Read Data                            */

    struct {
      __IOM uint32_t TMCREAD1   : 32;           /*!< [31..0] Debug Read data                                                   */
    } TMCRD1_b;
  } ;

  union {
    __IOM uint32_t TMCRD2;                      /*!< (@ 0x00000068) MRAM Controller Debug Read Data                            */

    struct {
      __IOM uint32_t TMCREAD2   : 32;           /*!< [31..0] Debug Read data                                                   */
    } TMCRD2_b;
  } ;

  union {
    __IOM uint32_t TMCRD3;                      /*!< (@ 0x0000006C) MRAM Controller Debug Read Data                            */

    struct {
      __IOM uint32_t TMCREAD3   : 32;           /*!< [31..0] Debug Read data                                                   */
    } TMCRD3_b;
  } ;

  union {
    __IOM uint32_t TMCREGIFDOUT;                /*!< (@ 0x00000070) MRAM Controller Debug Read Data                            */

    struct {
      __IOM uint32_t TMCREGDOUT : 32;           /*!< [31..0] Debug Read data                                                   */
    } TMCREGIFDOUT_b;
  } ;
} MRAM_Type;                                    /*!< Size = 116 (0x74)                                                         */

/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif

/* =========================================================================================================================== */
/* ================                                           MRAM                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
#define MRAM_STATUS_ADDRERROR_Pos         (1UL)                     /*!< ADDRERROR (Bit 1)                                     */
#define MRAM_STATUS_ADDRERROR_Msk         (0x2UL)                   /*!< ADDRERROR (Bitfield-Mask: 0x01)                       */
#define MRAM_STATUS_BUSY_Pos              (0UL)                     /*!< BUSY (Bit 0)                                          */
#define MRAM_STATUS_BUSY_Msk              (0x1UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
/* =========================================================  CTRL  ========================================================== */
#define MRAM_CTRL_GENCMD_Pos              (3UL)                     /*!< GENCMD (Bit 3)                                        */
#define MRAM_CTRL_GENCMD_Msk              (0x8UL)                   /*!< GENCMD (Bitfield-Mask: 0x01)                          */
#define MRAM_CTRL_PROGRAM_Pos             (2UL)                     /*!< PROGRAM (Bit 2)                                       */
#define MRAM_CTRL_PROGRAM_Msk             (0x4UL)                   /*!< PROGRAM (Bitfield-Mask: 0x01)                         */
#define MRAM_CTRL_CLRLOAD_Pos             (1UL)                     /*!< CLRLOAD (Bit 1)                                       */
#define MRAM_CTRL_CLRLOAD_Msk             (0x2UL)                   /*!< CLRLOAD (Bitfield-Mask: 0x01)                         */
#define MRAM_CTRL_LOAD_Pos                (0UL)                     /*!< LOAD (Bit 0)                                          */
#define MRAM_CTRL_LOAD_Msk                (0x1UL)                   /*!< LOAD (Bitfield-Mask: 0x01)                            */
/* ========================================================  ACCESS  ========================================================= */
#define MRAM_ACCESS_ACCESS_Pos            (0UL)                     /*!< ACCESS (Bit 0)                                        */
#define MRAM_ACCESS_ACCESS_Msk            (0xffffffffUL)            /*!< ACCESS (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  WRADDR  ========================================================= */
#define MRAM_WRADDR_INFO1_Pos             (31UL)                    /*!< INFO1 (Bit 31)                                        */
#define MRAM_WRADDR_INFO1_Msk             (0x80000000UL)            /*!< INFO1 (Bitfield-Mask: 0x01)                           */
#define MRAM_WRADDR_INFO0_Pos             (30UL)                    /*!< INFO0 (Bit 30)                                        */
#define MRAM_WRADDR_INFO0_Msk             (0x40000000UL)            /*!< INFO0 (Bitfield-Mask: 0x01)                           */
#define MRAM_WRADDR_ADDR_Pos              (0UL)                     /*!< ADDR (Bit 0)                                          */
#define MRAM_WRADDR_ADDR_Msk              (0xffffffUL)              /*!< ADDR (Bitfield-Mask: 0xffffff)                        */
/* ========================================================  WDATA0  ========================================================= */
#define MRAM_WDATA0_DATA0_Pos             (0UL)                     /*!< DATA0 (Bit 0)                                         */
#define MRAM_WDATA0_DATA0_Msk             (0xffffffffUL)            /*!< DATA0 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  WDATA1  ========================================================= */
#define MRAM_WDATA1_DATA1_Pos             (0UL)                     /*!< DATA1 (Bit 0)                                         */
#define MRAM_WDATA1_DATA1_Msk             (0xffffffffUL)            /*!< DATA1 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  WDATA2  ========================================================= */
#define MRAM_WDATA2_DATA2_Pos             (0UL)                     /*!< DATA2 (Bit 0)                                         */
#define MRAM_WDATA2_DATA2_Msk             (0xffffffffUL)            /*!< DATA2 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  WDATA3  ========================================================= */
#define MRAM_WDATA3_DATA3_Pos             (0UL)                     /*!< DATA3 (Bit 0)                                         */
#define MRAM_WDATA3_DATA3_Msk             (0xffffffffUL)            /*!< DATA3 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  KEY0  ========================================================== */
#define MRAM_KEY0_KEY0_Pos                (0UL)                     /*!< KEY0 (Bit 0)                                          */
#define MRAM_KEY0_KEY0_Msk                (0xffffffffUL)            /*!< KEY0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY1  ========================================================== */
#define MRAM_KEY1_KEY1_Pos                (0UL)                     /*!< KEY1 (Bit 0)                                          */
#define MRAM_KEY1_KEY1_Msk                (0xffffffffUL)            /*!< KEY1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY2  ========================================================== */
#define MRAM_KEY2_KEY2_Pos                (0UL)                     /*!< KEY2 (Bit 0)                                          */
#define MRAM_KEY2_KEY2_Msk                (0xffffffffUL)            /*!< KEY2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY3  ========================================================== */
#define MRAM_KEY3_KEY3_Pos                (0UL)                     /*!< KEY3 (Bit 0)                                          */
#define MRAM_KEY3_KEY3_Msk                (0xffffffffUL)            /*!< KEY3 (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  TMCCTRL  ======================================================== */
#define MRAM_TMCCTRL_TMCOVERRIDE_Pos      (4UL)                     /*!< TMCOVERRIDE (Bit 4)                                   */
#define MRAM_TMCCTRL_TMCOVERRIDE_Msk      (0x10UL)                  /*!< TMCOVERRIDE (Bitfield-Mask: 0x01)                     */
#define MRAM_TMCCTRL_TMCSLP_Pos           (3UL)                     /*!< TMCSLP (Bit 3)                                        */
#define MRAM_TMCCTRL_TMCSLP_Msk           (0x8UL)                   /*!< TMCSLP (Bitfield-Mask: 0x01)                          */
#define MRAM_TMCCTRL_TMCPD_Pos            (2UL)                     /*!< TMCPD (Bit 2)                                         */
#define MRAM_TMCCTRL_TMCPD_Msk            (0x4UL)                   /*!< TMCPD (Bitfield-Mask: 0x01)                           */
#define MRAM_TMCCTRL_TMCLPR_Pos           (1UL)                     /*!< TMCLPR (Bit 1)                                        */
#define MRAM_TMCCTRL_TMCLPR_Msk           (0x2UL)                   /*!< TMCLPR (Bitfield-Mask: 0x01)                          */
#define MRAM_TMCCTRL_TMCRST_Pos           (0UL)                     /*!< TMCRST (Bit 0)                                        */
#define MRAM_TMCCTRL_TMCRST_Msk           (0x1UL)                   /*!< TMCRST (Bitfield-Mask: 0x01)                          */
/* ========================================================  TMCCMD  ========================================================= */
#define MRAM_TMCCMD_TMCIFREN1_Pos         (25UL)                    /*!< TMCIFREN1 (Bit 25)                                    */
#define MRAM_TMCCMD_TMCIFREN1_Msk         (0x2000000UL)             /*!< TMCIFREN1 (Bitfield-Mask: 0x01)                       */
#define MRAM_TMCCMD_TMCSRAMDMA_Pos        (24UL)                    /*!< TMCSRAMDMA (Bit 24)                                   */
#define MRAM_TMCCMD_TMCSRAMDMA_Msk        (0x1000000UL)             /*!< TMCSRAMDMA (Bitfield-Mask: 0x01)                      */
#define MRAM_TMCCMD_TMCINFO1_Pos          (23UL)                    /*!< TMCINFO1 (Bit 23)                                     */
#define MRAM_TMCCMD_TMCINFO1_Msk          (0x800000UL)              /*!< TMCINFO1 (Bitfield-Mask: 0x01)                        */
#define MRAM_TMCCMD_TMCINFO0_Pos          (22UL)                    /*!< TMCINFO0 (Bit 22)                                     */
#define MRAM_TMCCMD_TMCINFO0_Msk          (0x400000UL)              /*!< TMCINFO0 (Bitfield-Mask: 0x01)                        */
#define MRAM_TMCCMD_TMCXADR_Pos           (10UL)                    /*!< TMCXADR (Bit 10)                                      */
#define MRAM_TMCCMD_TMCXADR_Msk           (0x3ffc00UL)              /*!< TMCXADR (Bitfield-Mask: 0xfff)                        */
#define MRAM_TMCCMD_TMCYADR_Pos           (5UL)                     /*!< TMCYADR (Bit 5)                                       */
#define MRAM_TMCCMD_TMCYADR_Msk           (0x3e0UL)                 /*!< TMCYADR (Bitfield-Mask: 0x1f)                         */
#define MRAM_TMCCMD_TMCCMD_Pos            (0UL)                     /*!< TMCCMD (Bit 0)                                        */
#define MRAM_TMCCMD_TMCCMD_Msk            (0x1fUL)                  /*!< TMCCMD (Bitfield-Mask: 0x1f)                          */
/* ========================================================  TMCSTAT  ======================================================== */
#define MRAM_TMCSTAT_TMCBUSY_Pos          (8UL)                     /*!< TMCBUSY (Bit 8)                                       */
#define MRAM_TMCSTAT_TMCBUSY_Msk          (0x100UL)                 /*!< TMCBUSY (Bitfield-Mask: 0x01)                         */
#define MRAM_TMCSTAT_TMCERROR_Pos         (0UL)                     /*!< TMCERROR (Bit 0)                                      */
#define MRAM_TMCSTAT_TMCERROR_Msk         (0x1fUL)                  /*!< TMCERROR (Bitfield-Mask: 0x1f)                        */
/* ========================================================  TMCRD0  ========================================================= */
#define MRAM_TMCRD0_TMCREAD0_Pos          (0UL)                     /*!< TMCREAD0 (Bit 0)                                      */
#define MRAM_TMCRD0_TMCREAD0_Msk          (0xffffffffUL)            /*!< TMCREAD0 (Bitfield-Mask: 0xffffffff)                  */
/* ========================================================  TMCRD1  ========================================================= */
#define MRAM_TMCRD1_TMCREAD1_Pos          (0UL)                     /*!< TMCREAD1 (Bit 0)                                      */
#define MRAM_TMCRD1_TMCREAD1_Msk          (0xffffffffUL)            /*!< TMCREAD1 (Bitfield-Mask: 0xffffffff)                  */
/* ========================================================  TMCRD2  ========================================================= */
#define MRAM_TMCRD2_TMCREAD2_Pos          (0UL)                     /*!< TMCREAD2 (Bit 0)                                      */
#define MRAM_TMCRD2_TMCREAD2_Msk          (0xffffffffUL)            /*!< TMCREAD2 (Bitfield-Mask: 0xffffffff)                  */
/* ========================================================  TMCRD3  ========================================================= */
#define MRAM_TMCRD3_TMCREAD3_Pos          (0UL)                     /*!< TMCREAD3 (Bit 0)                                      */
#define MRAM_TMCRD3_TMCREAD3_Msk          (0xffffffffUL)            /*!< TMCREAD3 (Bitfield-Mask: 0xffffffff)                  */
/* =====================================================  TMCREGIFDOUT  ====================================================== */
#define MRAM_TMCREGIFDOUT_TMCREGDOUT_Pos  (0UL)                     /*!< TMCREGDOUT (Bit 0)                                    */
#define MRAM_TMCREGIFDOUT_TMCREGDOUT_Msk  (0xffffffffUL)            /*!< TMCREGDOUT (Bitfield-Mask: 0xffffffff)                */

/* =========================================================================================================================== */
/* ================                                           MRAM                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
/* =============================================  MRAM STATUS ADDRERROR [1..1]  ============================================== */
typedef enum {                                  /*!< MRAM_STATUS_ADDRERROR                                                     */
  MRAM_STATUS_ADDRERROR_VALID          = 0,     /*!< VALID : The last address written to WRADDR was valid.                     */
  MRAM_STATUS_ADDRERROR_INVALID        = 1,     /*!< INVALID : Invalid address written to WRADDR.                              */
} MRAM_STATUS_ADDRERROR_Enum;

