AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo4l/regs/apollo4b_mram.h
/* ================================================  MRAM STATUS BUSY [0..0]  ================================================ */
typedef enum {                                  /*!< MRAM_STATUS_BUSY                                                          */
  MRAM_STATUS_BUSY_IDLE                = 0,     /*!< IDLE : MRAM controller is idle and ready for a new command.               */
  MRAM_STATUS_BUSY_MRAMBUSY            = 1,     /*!< MRAMBUSY : MRAM controller is processing an operation.                    */
} MRAM_STATUS_BUSY_Enum;

/* =========================================================  CTRL  ========================================================== */
/* ================================================  MRAM CTRL GENCMD [3..3]  ================================================ */
typedef enum {                                  /*!< MRAM_CTRL_GENCMD                                                          */
  MRAM_CTRL_GENCMD_TERMINATE           = 0,     /*!< TERMINATE : Terminate the programming operation.                          */
  MRAM_CTRL_GENCMD_GO                  = 1,     /*!< GO : Initiate a programming operation to flash data.                      */
} MRAM_CTRL_GENCMD_Enum;

/* ===============================================  MRAM CTRL PROGRAM [2..2]  ================================================ */
typedef enum {                                  /*!< MRAM_CTRL_PROGRAM                                                         */
  MRAM_CTRL_PROGRAM_TERMINATE          = 0,     /*!< TERMINATE : Terminate the programming operation.                          */
  MRAM_CTRL_PROGRAM_GO                 = 1,     /*!< GO : Initiate a programming operation to flash data.                      */
} MRAM_CTRL_PROGRAM_Enum;

/* ===============================================  MRAM CTRL CLRLOAD [1..1]  ================================================ */
typedef enum {                                  /*!< MRAM_CTRL_CLRLOAD                                                         */
  MRAM_CTRL_CLRLOAD_GO                 = 1,     /*!< GO : Initiate a programming operation to flash info.                      */
} MRAM_CTRL_CLRLOAD_Enum;

/* =================================================  MRAM CTRL LOAD [0..0]  ================================================= */
typedef enum {                                  /*!< MRAM_CTRL_LOAD                                                            */
  MRAM_CTRL_LOAD_GO                    = 1,     /*!< GO : Initiate a programming operation to flash info.                      */
} MRAM_CTRL_LOAD_Enum;

/* ========================================================  ACCESS  ========================================================= */
/* ==============================================  MRAM ACCESS ACCESS [0..31]  =============================================== */
typedef enum {                                  /*!< MRAM_ACCESS_ACCESS                                                        */
  MRAM_ACCESS_ACCESS_Key               = 195,   /*!< Key : Key value to unlock the register.                                   */
} MRAM_ACCESS_ACCESS_Enum;

/* ========================================================  TMCCMD  ========================================================= */
/* ===============================================  MRAM TMCCMD TMCCMD [0..4]  =============================================== */
typedef enum {                                  /*!< MRAM_TMCCMD_TMCCMD                                                        */
  MRAM_TMCCMD_TMCCMD_NOP               = 0,     /*!< NOP : No operation                                                        */
  MRAM_TMCCMD_TMCCMD_READ              = 1,     /*!< READ : Perform read                                                       */
  MRAM_TMCCMD_TMCCMD_LOAD              = 2,     /*!< LOAD : Perform buffer load (pre-programming step)                         */
  MRAM_TMCCMD_TMCCMD_WRITE             = 3,     /*!< WRITE : Perform buffer write                                              */
  MRAM_TMCCMD_TMCCMD_CLRLOAD           = 4,     /*!< CLRLOAD : Clear Load Buffers                                              */
  MRAM_TMCCMD_TMCCMD_WRITECFG          = 5,     /*!< WRITECFG : Write Config                                                   */
  MRAM_TMCCMD_TMCCMD_READCFG           = 6,     /*!< READCFG : Read Config                                                     */
  MRAM_TMCCMD_TMCCMD_WAKEUP            = 12,    /*!< WAKEUP : Wake up command                                                  */
  MRAM_TMCCMD_TMCCMD_AUTOWAKEUP        = 13,    /*!< AUTOWAKEUP : Auto Wake up command                                         */
  MRAM_TMCCMD_TMCCMD_RECALL            = 22,    /*!< RECALL : Recall                                                           */
} MRAM_TMCCMD_TMCCMD_Enum;

#define MRAM                        ((MRAM_Type*)              MRAM_BASE)

#ifdef __cplusplus
}
#endif

#endif /* APOLLO4B_MRAM_H */
